In [8]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv("/content/dataset_1.csv")

In [10]:
df.head()

   Index   Age     Salary  Rating       Location  Established Easy Apply
0      0  44.0  $44k-$99k     5.4       India,In         1999       TRUE
1      1  66.0  $55k-$66k     3.5    New York,Ny         2002       TRUE
2      2   NaN  $77k-$89k    -1.0    New York,Ny           -1         -1
3      3  64.0  $44k-$99k     4.4       India In         1988         -1
4      4  25.0  $44k-$99k     6.4  Australia Aus         2002         -1

In [11]:
# check for missing data
print("Missing Data\n", df.isnull().sum())

Missing Data
 Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [32]:
# handling missing values
df['Age']= df['Age'].fillna(df['Age'].median())
df['Rating']= df['Rating'].fillna(df['Rating'].median())
print(df.isnull().sum())

Index          0
Age            0
Salary         0
Rating         0
Location       0
Established    0
Easy Apply     0
dtype: int64

In [16]:
# data types
data_types = df.dtypes
print(data_types)

Index            int64
Age            float64
Salary          object
Rating         float64
Location        object
Established      int64
Easy Apply      object
dtype: object

In [33]:
# changing data type
df['Age'] = df['Age'].astype(int)
df['Age'].dtypes

dtype('int64')

In [26]:
# salary column
df['Salary'] = df['Salary'].str.replace('$', '', regex=False)
df['Salary'].head(5)

0    44k-99k
1    55k-66k
2    77k-89k
3    44k-99k
4    44k-99k
Name: Salary, dtype: object

In [40]:
# rating column
df['Rating'] = df['Rating'].replace(-1,0)
df['Rating'] = df.Rating.round(decimals=1)
df['Rating'].head(5)

0    5.4
1    3.5
2    0.0
3    4.4
4    6.4
Name: Rating, dtype: float64

In [34]:
#location column
def format_location(location):
    return location.split(',')[0].strip().split(' ')[0].strip()
# Apply the function to the 'Location' column
df['Location'] = df['Location'].apply(format_location)
df['Location'] = df['Location'].replace('New','New York')
df['Location'].head(5)

0        India
1     New York
2     New York
3        India
4    Australia
Name: Location, dtype: object

In [35]:
# established column
median_age=df['Established'].median()
df['Established']=df['Established'].replace(-1,median_age)
df['Established'].head(5)

0    1999
1    2002
2    1984
3    1988
4    2002
Name: Established, dtype: int64

In [36]:
# easy Apply
df['Easy Apply'] = df['Easy Apply'].replace('-1','False').replace('TRUE','True')
df['Easy Apply'].head(5)

0     True
1     True
2    False
3    False
4    False
Name: Easy Apply, dtype: object

In [41]:
print(df)

    Index  Age    Salary  Rating   Location  Established Easy Apply
0       0   44   44k-99k     5.4      India         1999       True
1       1   66   55k-66k     3.5   New York         2002       True
2       2   39   77k-89k     0.0   New York         1984      False
3       3   64   44k-99k     4.4      India         1988      False
4       4   25   44k-99k     6.4  Australia         2002      False
5       5   44   77k-89k     1.4      India         1999       True
6       6   21   44k-99k     0.0   New York         1984      False
7       7   44   44k-99k     0.0  Australia         1984      False
8       8   35   44k-99k     5.4   New York         1984      False
9       9   22   44k-99k     7.7      India         1984       True
10     10   55   10k-49k     5.4      India         2008       True
11     11   44   10k-49k     6.7      India         2009      False
12     12   39   44k-99k     0.0      India         1999      False
13     13   25   44k-99k     0.0  Australia         2019       True
14     14   66   44k-99k     4.0  Australia         2020       True
15     15   44  88k-101k     3.0  Australia         1999      False
16     16   19   19k-40k     4.5      India         1984      False
17     17   39   44k-99k     5.3   New York         1943       True
18     18   35   44k-99k     6.7   New York         1954       True
19     19   32   44k-99k     3.3   New York         1955       True
20     20   39   44k-99k     5.7   New York         1944       True
21     21   35   44k-99k     5.0   New York         1946      False
22     22   19   55k-66k     7.8   New York         1988       True
23     23   39   44k-99k     2.4   New York         1999       True
24     24   13   44k-99k     0.0   New York         1987      False
25     25   55   44k-99k     0.0  Australia         1980       True
26     26   39   55k-66k     4.2      India         1934       True
27     27   52   44k-99k     5.4      India         1935      False
28     28   39   39k-88k     3.4  Australia         1932      False

In [42]:
csv_file_path = '/content/dataset_1.csv'
df.to_csv(csv_file_path, index=False)
print(f'DataFrame saved to {csv_file_path}')

DataFrame saved to /content/dataset_1.csv